x = int(input('Введите число от 1 до 999999 = '))
n = len(str(x))
itog = ''
m1 = ''
m2 = ''
m3 = ''
m4 = ''
m5 = ''
m6 = ''
if 7 > n > 3:
    c1 = x % 1000
    c2 = x // 1000
elif n > 6:
    print('Ошибка, введите число от 1 до 999999!')
elif 0 < n < 4:
    c1 = x
a1 = c1 % 10
a3 = c1 // 100
a2 = (c1 - a3 * 100 - a1) // 10
#присвоение рублей
if a1 > 0:
    if a1 == 1:
        rub = 'рубль'
    if a1 == 1 and a2 == 1:
        rub = 'рублей'
    if a1 == 2:
        rub = 'рубля'
    if a1 == 2 and a2 == 1:
        rub = 'рублей'
    if a1 == 3:
        rub = 'рубля'
    if a1 == 3 and a2 == 1:
        rub = 'рублей'
    if a1 == 4:
        rub = 'рубля'
    if a1 == 4 and a2 == 1:
        rub = 'рублей'
    elif a1 > 4:
        rub = 'рублей'
else:
    rub = 'рублей'
if a1 > 0 and a2 != 1:
    if a1 == 1:
        m1 = 'один'
    if a1 == 2:
        m1 = 'два'
    if a1 == 3:
        m1 = 'три'
    if a1 == 4:
        m1 = 'четыре'
    if a1 == 5:
        m1 = 'пять'
    if a1 == 6:
        m1 = 'шесть'
    if a1 == 7:
        m1 = 'семь'
    if a1 == 8:
        m1 = 'восемь'
    if a1 == 9:
        m1 = 'девять'
if a2 == 1:
    if a1 == 0:
        m2 = 'десять'
    if a1 == 1:
        m2 = 'одиннадцать'
    if a1 == 2:
        m2 = 'двенадцать'
    if a1 == 3:
        m2 = 'тринадцать'
    if a1 == 4:
        m2 = 'четырнадцать'
    if a1 == 5:
        m2 = 'пятнадцать'
    if a1 == 6:
        m2 = 'шестнадцать'
    if a1 == 7:
        m2 = 'семнадцать'
    if a1 == 8:
        m2 = 'восемнадцать'
    if a1 == 9:
        m2 = 'девятнадцать'
elif a2 > 1:
    if a2 == 2:
        m2 = 'двадцать'
    if a2 == 3:
        m2 = 'тридцать'
    if a2 == 4:
        m2 = 'сорок'
    if a2 == 5:
        m2 = 'пятьдесят'
    if a2 == 6:
        m2 = 'шестьдесят'
    if a2 == 7:
        m2 = 'семьдесят'
    if a2 == 8:
        m2 = 'восемьдесят'
    if a2 == 9:
        m2 = 'девяносто'
if a3 > 0:
    if a3 == 1:
        m3 = 'сто'
    if a3 == 2:
        m3 = 'двести'
    if a3 == 3:
        m3 = 'триста'
    if a3 == 4:
        m3 = 'четыреста'
    if a3 == 5:
        m3 = 'пятьсот'
    if a3 == 6:
        m3 = 'шестьсот'
    if a3 == 7:
        m3 = 'семьсот'
    if a3 == 8:
        m3 = 'восемьсот'
    if a3 == 9:
        m3 = 'девятьсот'
if n < 4:
    if m3 != '':
        itog = m3 + ' '
    if m2 != '':
        itog = itog + m2 + ' '
    if m1 != '':
        itog = itog + m1 + ' '
    itog = itog + rub
if n > 3:
    a4 = c2 % 10
    a6 = c2 // 100
    a5 = (c2 - a6 * 100 - a4) // 10
    if a4 > 0 and a5 != 1:
        if a4 == 1:
            m4 = 'одна'
        if a4 == 2:
            m4 = 'две'
        if a4 == 3:
            m4 = 'три'
        if a4 == 4:
            m4 = 'четыре'
        if a4 == 5:
            m4 = 'пять'
        if a4 == 6:
            m4 = 'шесть'
        if a4 == 7:
            m4 = 'семь'
        if a4 == 8:
            m4 = 'восемь'
        if a4 == 9:
            m4 = 'девять'
    if a5 == 1:
        if a4 == 0:
            m5 = 'десять'
        if a4 == 1:
            m5 = 'одиннадцать'
        if a4 == 2:
            m5 = 'двенадцать'
        if a4 == 3:
            m5 = 'тринадцать'
        if a4 == 4:
            m5 = 'четырнадцать'
        if a4 == 5:
            m5 = 'пятнадцать'
        if a4 == 6:
            m5 = 'шестнадцать'
        if a4 == 7:
            m5 = 'семнадцать'
        if a4 == 8:
            m5 = 'восемнадцать'
        if a4 == 9:
            m5 = 'девятнадцать'
    elif a5 > 1:
        if a5 == 2:
            m5 = 'двадцать'
        if a5 == 3:
            m5 = 'тридцать'
        if a5 == 4:
            m5 = 'сорок'
        if a5 == 5:
            m5 = 'пятьдесят'
        if a5 == 6:
            m5 = 'шестьдесят'
        if a5 == 7:
            m5 = 'семьдесят'
        if a5 == 8:
            m5 = 'восемьдесят'
        if a5 == 9:
            m5 = 'девяносто'
    else:
        if a6 == 1:
            m6 = 'сто'
        if a6 == 2:
            m6 = 'двести'
        if a6 == 3:
            m6 = 'триста'
        if a6 == 4:
            m6 = 'четыреста'
        if a6 == 5:
            m6 = 'пятьсот'
        if a6 == 6:
            m6 = 'шестьсот'
        if a6 == 7:
            m6 = 'семьсот'
        if a6 == 8:
            m6 = 'восемьсот'
        if a6 == 9:
            m6 = 'девятьсот'
    #присвоение тысяч
    if 5 > a4 > 0 and a5 != 1:
        if a4 == 1:
            tis = 'тысяча'
        elif a4 == 2:
            tis = 'тысячи'
        elif a4 == 3:
            tis = 'тысячи'
        elif a4 == 4:
            tis = 'тысячи'
    else:
        tis = 'тысяч'
    if m6 != '':
        itog = m6 + ' '
    if m5 != '':
        itog = itog + m5 + ' '
    if m4 != '':
        itog = itog + m4 + ' '
    if m4 != '' or m5 != '' or m6 != '':
        itog = itog + tis + ' '
    if m3 != '':
        itog = itog + m3 + ' '
    if m2 != '':
        itog = itog + m2 + ' '
    if m1 != '':
        itog = itog + m1 + ' '
    itog = itog + rub
print(str.capitalize(itog))